Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes Methods
The PreferredPlacingTypes type exposes the following members.
Methods
Name | Description
AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
 The object is placed using the along line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line and rotated to be at the same angle as the connected part.
AlongLineOrWithLeaderLinePlacingType
 The object is placed using the along line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line.
AlongLinePlacingType
 The object is placed using the along line placing.
AlongPartCenteredPlacingType
 The object is placed using the along line placing. The line used will be the part's edge in the center of that line.
BaseLinePlacingType
 The object is placed using the base line placing.
BaseLineWithArrowAtEndPointPlacingType
 The object is placed using the base line placing. The line is drawn and will have an arrow at the end point.
BaseLineWithArrowAtStartPointPlacingType
 The object is placed using the base line placing. The line is drawn and will have an arrow at the start point.
InsidePartAlongPartOrWithLeaderLinePlacingType
 The object is placed using the base line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line. The base line used is in the middle of the part, aligned with the part.
InsidePartAlongPartPlacingType
 The object is placed using the base line placing. The base line used is in the middle of the part, aligned with the part.
InsidePartHorizontalOrWithLeaderLinePlacingType
 The object is placed using the base line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line. The base line used is in the middle of the part, aligned with the part. In addition the object will be rotated to be horizontal in the drawing.
InsidePartHorizontalPlacingType
 The object is placed using the base line placing. The base line used is in the middle of the part, aligned with the part. In addition the object will be rotated to be horizontal in the drawing.
LeaderLineAndParentObjectAlongPartPlacingType
 The object is placed with a leader line and rotated to be at the same angle as the connected part.
LeaderLinePlacingType
 The object is placed with a leader line.
PointPlacingType
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace